Autodesk.Revit.UI.DockablePane.PaneExists(Autodesk.Revit.UI.DockablePaneId)
Returns true if %id% refers to a dockable pane window that currently exists in the Revit user interface, whether it's hidden or shown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePane.PaneIsRegistered(Autodesk.Revit.UI.DockablePaneId)
Returns true if %id% refers to a built-in Revit dockable pane, or an add-in pane that has been properly registered with %Autodesk.Revit.UI.UIApplication.RegisterDockablePane%.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePane.PaneIsBuiltIn(Autodesk.Revit.UI.DockablePaneId)
Returns true if %id% refers to a built-in Revit dockable pane, rather than one created by an add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePane.IsShown
Identify the pane is currently visible or in a tab.
Since:
2015

Autodesk.Revit.UI.DockablePane.Hide
If the pane is on screen, hide it.  Has no effect on built-in Revit dockable panes.
Since:
2014

Autodesk.Revit.UI.DockablePane.Show
If the pane is not currently visible or in a tab, display the pane in the Revit user interface at its last docked location.
Since:
2014

Autodesk.Revit.UI.DockablePane.GetTitle
Returns the current title (a.k.a. window caption) of the dockable pane.
Since:
2014

Autodesk.Revit.UI.DockablePane.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.DockablePane.Id
The unique identifier for this dockable pane.
Since:
2014

Autodesk.Revit.UI.DockablePane.#ctor(Autodesk.Revit.UI.DockablePane)
Constructs a new copy of the input DockablePane object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePane.#ctor(Autodesk.Revit.UI.DockablePaneId)
Gets the pane with identifier %id%.
Throws Autodesk.Revit.Exceptions.ArgumentException:
no dockable pane has been registered with identifier id.
-or-
the dockable pane with identifier id has not been created yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.DockablePane
A user interface pane that participates in Revit's docking window system.
Since:
2014